Bwooce/tinygs_nRF52/src/main.cpp
/* -------------------------------------------------------------------------- */
/* MQTT-TLS Connection                                                         */
/* -------------------------------------------------------------------------- */

/*
 * TLS socket test — connect directly to mqtt.tinygs.com via public NAT64.
 * Google NAT64 prefix: 64:ff9b::/96
 * mqtt.tinygs.com = 159.195.74.23 → 64:ff9b::9fc3:4a17
 */
static int test_tls_nat64(void)
{
    struct sockaddr_in6 dest;
    memset(&dest, 0, sizeof(dest));
    dest.sin6_family = AF_INET6;
    dest.sin6_port = htons(8883);

    /* 64:ff9b::9fc3:4a17 (mqtt.tinygs.com via Google NAT64) */
    otIp6Address nat64;
    memset(&nat64, 0, sizeof(nat64));
    nat64.mFields.m16[0] = htons(0x0064);
    nat64.mFields.m16[1] = htons(0xff9b);
    /* m16[2..5] = 0 */
    nat64.mFields.m8[12] = 159;
    nat64.mFields.m8[13] = 195;
    nat64.mFields.m8[14] = 74;
    nat64.mFields.m8[15] = 23;
    memcpy(&dest.sin6_addr, &nat64, 16);

    char addr_str[INET6_ADDRSTRLEN];
    net_addr_ntop(AF_INET6, &dest.sin6_addr, addr_str, sizeof(addr_str));

    /* Test 1: Plain TCP to public NAT64 address */
    LOG_INF("NAT64 test: TCP to [%s]:8883 ...", addr_str);
    int sock = zsock_socket(AF_INET6, SOCK_STREAM, IPPROTO_TCP);
    if (sock >= 0) {
        int ret = zsock_connect(sock, (struct sockaddr *)&dest, sizeof(dest));
        if (ret == 0) {
            LOG_INF("=== NAT64 TCP SUCCEEDED! ===");
        } else {
            LOG_ERR("NAT64 TCP connect failed: errno=%d", errno);
        }
        zsock_close(sock);
    }

    /* Test 2: TLS socket to same address */
    LOG_INF("NAT64 test: TLS to [%s]:8883 ...", addr_str);
    sock = zsock_socket(AF_INET6, SOCK_STREAM, IPPROTO_TLS_1_2);
    if (sock >= 0) {
        int peer_verify = TLS_PEER_VERIFY_NONE;
        zsock_setsockopt(sock, SOL_TLS, TLS_PEER_VERIFY,
                          &peer_verify, sizeof(peer_verify));

        int ret = zsock_connect(sock, (struct sockaddr *)&dest, sizeof(dest));
        if (ret == 0) {
            LOG_INF("=== NAT64 TLS SUCCEEDED! ===");
        } else {
            LOG_ERR("NAT64 TLS connect failed: errno=%d", errno);
        }
        zsock_close(sock);
    } else {
        LOG_ERR("NAT64 TLS socket() failed: errno=%d", errno);
    }

    return 0;
}

static int mqtt_tls_connect(void)
{
    LOG_INF("Connecting MQTT to [%s]:%d ...", MQTT_BROKER_HOSTNAME, MQTT_BROKER_PORT);

    mqtt_client_init(&mqtt_client);

    mqtt_client.broker = &broker_addr;

    /* Populate device client ID if not done yet */
    if (device_client_id[0] == '\0') {
        uint64_t dev_id = NRF_FICR->DEVICEID[0] |
                          ((uint64_t)NRF_FICR->DEVICEID[1] << 32);
        snprintf(device_client_id, sizeof(device_client_id),
                 "%04X%08X", (uint16_t)(dev_id >> 32), (uint32_t)dev_id);
        LOG_INF("Device client ID: %s", device_client_id);
    }
    mqtt_client.client_id.utf8 = (uint8_t *)device_client_id;
    mqtt_client.client_id.size = strlen(device_client_id);

    static struct mqtt_utf8 username = {
        .utf8 = (uint8_t *)MQTT_USERNAME,
        .size = sizeof(MQTT_USERNAME) - 1,
    };
    static struct mqtt_utf8 password = {
        .utf8 = (uint8_t *)MQTT_PASSWORD,
        .size = sizeof(MQTT_PASSWORD) - 1,
    };
    mqtt_client.user_name = &username;
    mqtt_client.password = &password;

    /* Last Will Testament — tells server we disconnected */
    static char will_topic_str[128];
    snprintf(will_topic_str, sizeof(will_topic_str),
             TINYGS_TOPIC_STAT, MQTT_USERNAME, MQTT_CLIENT_ID, TINYGS_STAT_STATUS);
    static struct mqtt_topic will_topic = {
        .qos = MQTT_QOS_1_AT_LEAST_ONCE,
    };
    will_topic.topic.utf8 = (uint8_t *)will_topic_str;
    will_topic.topic.size = strlen(will_topic_str);
    static struct mqtt_utf8 will_msg = {
        .utf8 = (uint8_t *)"0",
        .size = 1,
    };
    mqtt_client.will_topic = &will_topic;
    mqtt_client.will_message = &will_msg;

    /* Buffers */
    mqtt_client.rx_buf = mqtt_rx_buf;
    mqtt_client.rx_buf_size = sizeof(mqtt_rx_buf);
    mqtt_client.tx_buf = mqtt_tx_buf;
    mqtt_client.tx_buf_size = sizeof(mqtt_tx_buf);

    /* Event handler */
    mqtt_client.evt_cb = mqtt_evt_handler;

    /* TLS direct to mqtt.tinygs.com via nat64.net public NAT64 */
    static sec_tag_t sec_tag_list[] = { MQTT_TLS_SEC_TAG };
    static bool cred_registered = false;

    if (!cred_registered) {
        int rc = tls_credential_add(MQTT_TLS_SEC_TAG,
                                     TLS_CREDENTIAL_CA_CERTIFICATE,
                                     tinygs_ca_cert,
                                     sizeof(tinygs_ca_cert));
        if (rc == 0 || rc == -EEXIST) {
            LOG_INF("TLS CA cert registered (sec_tag %d)", MQTT_TLS_SEC_TAG);
            cred_registered = true;
        } else {
            LOG_ERR("tls_credential_add failed: %d", rc);
        }
    }

    mqtt_client.transport.type = MQTT_TRANSPORT_SECURE;

    struct mqtt_sec_config *tls_cfg = &mqtt_client.transport.tls.config;
    tls_cfg->peer_verify = TLS_PEER_VERIFY_NONE;
    tls_cfg->cipher_list = NULL;
    tls_cfg->sec_tag_list = sec_tag_list;
    tls_cfg->sec_tag_count = ARRAY_SIZE(sec_tag_list);
    tls_cfg->hostname = MQTT_BROKER_HOSTNAME;
    tls_cfg->session_cache = TLS_SESSION_CACHE_ENABLED;

    LOG_INF("Connecting with TLS...");

    /* Enable mbedTLS debug output (level 2 = state changes + info) */
    int dbg_level = 2;
    /* Note: this gets applied after socket creation, inside mqtt_connect */

    int ret = mqtt_connect(&mqtt_client);
    if (ret != 0) {
        LOG_ERR("mqtt_connect() failed: %d (errno=%d)", ret, errno);
        return ret;
    }

    LOG_INF("mqtt_connect() returned OK, waiting for CONNACK...");
    return 0;
}

/* -------------------------------------------------------------------------- */
/* USB MSC & FATFS                                                             */
/* -------------------------------------------------------------------------- */

